ClearDotX/TRK-KEA8_128/LINStack/Examples/S12Z_examples/Hearst_S12ZVC64/S12ZVC64_master/Project_Headers/mc9s12zvc64.h
#define INTEN_TBEIE_MASK                1U
#define INTEN_TCIE_MASK                 2U
#define INTEN_CSIE_MASK                 4U
#define INTEN_TUIE_MASK                 8U
#define INTEN_PPREIE_MASK               16U


/*** INTFLG - SENT Transmitter Interrupt Flag Register; 0x000009A7 ***/
typedef union {
  byte Byte;
  struct {
    byte TBE         :1;                                       /* SENTTX Transmit-Buffer Empty Flag */
    byte TC          :1;                                       /* SENTTX Transmission Complete Flag */
    byte CS          :1;                                       /* SENTTX Calibration Pulse Start Flag */
    byte TU          :1;                                       /* SENTTX Transmitter Under-run Flag */
    byte PPRE        :1;                                       /* SENTTX Pause Pulse Rising-Edge Flag */
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} INTFLGSTR;
extern volatile INTFLGSTR _INTFLG @0x000009A7;
#define INTFLG                          _INTFLG.Byte
#define INTFLG_TBE                      _INTFLG.Bits.TBE
#define INTFLG_TC                       _INTFLG.Bits.TC
#define INTFLG_CS                       _INTFLG.Bits.CS
#define INTFLG_TU                       _INTFLG.Bits.TU
#define INTFLG_PPRE                     _INTFLG.Bits.PPRE

#define INTFLG_TBE_MASK                 1U
#define INTFLG_TC_MASK                  2U
#define INTFLG_CS_MASK                  4U
#define INTFLG_TU_MASK                  8U
#define INTFLG_PPRE_MASK                16U


/*** TXBUF - SENT Transmit Buffer Register; 0x000009A8 ***/
typedef union {
  dword Dword;
   /* Overlapped registers: */
  struct {
    /*** DATA_23 - SENT Transmit Buffer Register 23; 0x000009A8 ***/
    union {
      word Word;
       /* Overlapped registers: */
      struct {
        /*** DATA_3 - SENT Transmit Buffer Register 3; 0x000009A8 ***/
        union {
          byte Byte;
          struct {
            byte CRC         :4;                                       /* SENTTX CRC Nibble */
            byte STATCONF    :4;                                       /* SENTTX Status and Configuration Nibble */
          } Bits;
        } DATA_3STR;
        #define DATA_3                  _TXBUF.Overlap_STR.DATA_23STR.Overlap_STR.DATA_3STR.Byte
        #define DATA_3_CRC              _TXBUF.Overlap_STR.DATA_23STR.Overlap_STR.DATA_3STR.Bits.CRC
        #define DATA_3_STATCONF         _TXBUF.Overlap_STR.DATA_23STR.Overlap_STR.DATA_3STR.Bits.STATCONF
        
        #define DATA_3_CRC_MASK         15U
        #define DATA_3_CRC_BITNUM       0U
        #define DATA_3_STATCONF_MASK    240U
        #define DATA_3_STATCONF_BITNUM  4U
        
    
        /*** DATA_2 - SENT Transmit Buffer Register 2; 0x000009A9 ***/
        union {
          byte Byte;
          struct {
            byte DATA1       :4;                                       /* SENTTX Data Nibble 1 */
            byte DATA0       :4;                                       /* SENTTX Data Nibble 0 */
          } Bits;
        } DATA_2STR;
        #define DATA_2                  _TXBUF.Overlap_STR.DATA_23STR.Overlap_STR.DATA_2STR.Byte
        #define DATA_2_DATA1            _TXBUF.Overlap_STR.DATA_23STR.Overlap_STR.DATA_2STR.Bits.DATA1
        #define DATA_2_DATA0            _TXBUF.Overlap_STR.DATA_23STR.Overlap_STR.DATA_2STR.Bits.DATA0
        
        #define DATA_2_DATA1_MASK       15U
        #define DATA_2_DATA1_BITNUM     0U
        #define DATA_2_DATA0_MASK       240U
        #define DATA_2_DATA0_BITNUM     4U
        
      } Overlap_STR;
    
      struct {
        word CRC         :4;                                       /* SENTTX CRC Nibble */
        word STATCONF    :4;                                       /* SENTTX Status and Configuration Nibble */
        word DATA1       :4;                                       /* SENTTX Data Nibble 1 */
        word DATA0       :4;                                       /* SENTTX Data Nibble 0 */
      } Bits;
    } DATA_23STR;
    #define DATA_23                     _TXBUF.Overlap_STR.DATA_23STR.Word
    #define DATA_23_CRC                 _TXBUF.Overlap_STR.DATA_23STR.Bits.CRC
    #define DATA_23_STATCONF            _TXBUF.Overlap_STR.DATA_23STR.Bits.STATCONF
    #define DATA_23_DATA1               _TXBUF.Overlap_STR.DATA_23STR.Bits.DATA1
    #define DATA_23_DATA0               _TXBUF.Overlap_STR.DATA_23STR.Bits.DATA0
    
    #define DATA_23_CRC_MASK            15U
    #define DATA_23_CRC_BITNUM          0U
    #define DATA_23_STATCONF_MASK       240U
    #define DATA_23_STATCONF_BITNUM     4U
    #define DATA_23_DATA1_MASK          3840U
    #define DATA_23_DATA1_BITNUM        8U
    #define DATA_23_DATA0_MASK          61440U
    #define DATA_23_DATA0_BITNUM        12U
    

    /*** DATA_01 - SENT Transmit Buffer Register 01; 0x000009AA ***/
    union {
      word Word;
       /* Overlapped registers: */
      struct {
        /*** DATA_1 - SENT Transmit Buffer Register 1; 0x000009AA ***/
        union {
          byte Byte;
          struct {
            byte DATA3       :4;                                       /* SENTTX Data Nibble 3 */
            byte DATA2       :4;                                       /* SENTTX Data Nibble 2 */
          } Bits;
        } DATA_1STR;
        #define DATA_1                  _TXBUF.Overlap_STR.DATA_01STR.Overlap_STR.DATA_1STR.Byte
        #define DATA_1_DATA3            _TXBUF.Overlap_STR.DATA_01STR.Overlap_STR.DATA_1STR.Bits.DATA3
        #define DATA_1_DATA2            _TXBUF.Overlap_STR.DATA_01STR.Overlap_STR.DATA_1STR.Bits.DATA2
        
        #define DATA_1_DATA3_MASK       15U
        #define DATA_1_DATA3_BITNUM     0U
        #define DATA_1_DATA2_MASK       240U
        #define DATA_1_DATA2_BITNUM     4U
        
    
        /*** DATA_0 - SENT Transmit Buffer Register 0; 0x000009AB ***/
        union {
          byte Byte;
          struct {
            byte DATA5       :4;                                       /* SENTTX Data Nibble 5 */
            byte DATA4       :4;                                       /* SENTTX Data Nibble 4 */
          } Bits;
        } DATA_0STR;
        #define DATA_0                  _TXBUF.Overlap_STR.DATA_01STR.Overlap_STR.DATA_0STR.Byte
        #define DATA_0_DATA5            _TXBUF.Overlap_STR.DATA_01STR.Overlap_STR.DATA_0STR.Bits.DATA5
        #define DATA_0_DATA4            _TXBUF.Overlap_STR.DATA_01STR.Overlap_STR.DATA_0STR.Bits.DATA4
        
        #define DATA_0_DATA5_MASK       15U
        #define DATA_0_DATA5_BITNUM     0U
        #define DATA_0_DATA4_MASK       240U
        #define DATA_0_DATA4_BITNUM     4U
        
      } Overlap_STR;
    
